{
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "acinonyx-jubatus",
    "1": "aethia-cristatella",
    "2": "agalychnis-callidryas",
    "3": "agkistrodon-contortrix",
    "4": "ailuropoda-melanoleuca",
    "5": "ailurus-fulgens",
    "6": "alces-alces",
    "7": "anas-platyrhynchos",
    "8": "ankylosaurus-magniventris",
    "9": "apis-mellifera",
    "10": "aptenodytes-forsteri",
    "11": "aquila-chrysaetos",
    "12": "ara-macao",
    "13": "architeuthis-dux",
    "14": "ardea-herodias",
    "15": "balaenoptera-musculus",
    "16": "betta-splendens",
    "17": "bison-bison",
    "18": "bos-gaurus",
    "19": "bos-taurus",
    "20": "bradypus-variegatus",
    "21": "branta-canadensis",
    "22": "canis-lupus",
    "23": "canis-lupus-familiaris",
    "24": "carcharodon-carcharias",
    "25": "cardinalis-cardinalis",
    "26": "cathartes-aura",
    "27": "centrochelys-sulcata",
    "28": "centruroides-vittatus",
    "29": "ceratitis-capitata",
    "30": "ceratotherium-simum",
    "31": "chelonia-mydas",
    "32": "chrysemys-picta",
    "33": "circus-hudsonius",
    "34": "codium-fragile",
    "35": "coelacanthiformes",
    "36": "colaptes-auratus",
    "37": "connochaetes-gnou",
    "38": "correlophus-ciliatus",
    "39": "crocodylus-niloticus",
    "40": "crotalus-atrox",
    "41": "crotophaga-sulcirostris",
    "42": "cryptoprocta-ferox",
    "43": "cyanocitta-cristata",
    "44": "danaus-plexippus",
    "45": "dasypus-novemcinctus",
    "46": "delphinapterus-leucas",
    "47": "dendrobatidae",
    "48": "dermochelys-coriacea",
    "49": "desmodus-rotundus",
    "50": "diplodocus",
    "51": "dugong-dugon",
    "52": "eidolon-helvum",
    "53": "enhydra-lutris",
    "54": "enteroctopus-dofleini",
    "55": "equus-caballus",
    "56": "equus-quagga",
    "57": "eudocimus-albus",
    "58": "eunectes-murinus",
    "59": "falco-peregrinus",
    "60": "felis-catus",
    "61": "formicidae",
    "62": "gallus-gallus-domesticus",
    "63": "gavialis-gangeticus",
    "64": "geococcyx-californianus",
    "65": "giraffa-camelopardalis",
    "66": "gorilla-gorilla",
    "67": "haliaeetus-leucocephalus",
    "68": "hapalochlaena-maculosa",
    "69": "heloderma-suspectum",
    "70": "heterocera",
    "71": "hippopotamus-amphibius",
    "72": "homo-sapiens",
    "73": "hydrurga-leptonyx",
    "74": "icterus-galbula",
    "75": "icterus-gularis",
    "76": "icterus-spurius",
    "77": "iguana-iguana",
    "78": "iguanodon-bernissartensis",
    "79": "inia-geoffrensis",
    "80": "lampropeltis-triangulum",
    "81": "lemur-catta",
    "82": "lepus-americanus",
    "83": "loxodonta-africana",
    "84": "macropus-giganteus",
    "85": "malayopython-reticulatus",
    "86": "mammuthus-primigeniu",
    "87": "martes-americana",
    "88": "megaptera-novaeangliae",
    "89": "melanerpes-carolinus",
    "90": "mellisuga-helenae",
    "91": "mergus-serrator",
    "92": "mimus-polyglottos",
    "93": "monodon-monoceros",
    "94": "musca-domestica",
    "95": "odobenus-rosmarus",
    "96": "okapia-johnstoni",
    "97": "ophiophagus-hannah",
    "98": "orcinus-orca",
    "99": "ornithorhynchus-anatinus",
    "100": "ovis-aries",
    "101": "ovis-canadensis",
    "102": "panthera-leo",
    "103": "panthera-onca",
    "104": "panthera-pardus",
    "105": "panthera-tigris",
    "106": "pantherophis-alleghaniensis",
    "107": "pantherophis-guttatus",
    "108": "papilio-glaucus",
    "109": "passerina-ciris",
    "110": "pavo-cristatus",
    "111": "periplaneta-americana",
    "112": "phascolarctos-cinereus",
    "113": "phoebetria-fusca",
    "114": "phoenicopterus-ruber",
    "115": "phyllobates-terribilis",
    "116": "physalia-physalis",
    "117": "physeter-macrocephalus",
    "118": "poecile-atricapillus",
    "119": "pongo-abelii",
    "120": "procyon-lotor",
    "121": "pteranodon-longiceps",
    "122": "pterois-mombasae",
    "123": "pterois-volitans",
    "124": "puma-concolor",
    "125": "rattus-rattus",
    "126": "rusa-unicolor",
    "127": "salmo-salar",
    "128": "sciurus-carolinensis",
    "129": "smilodon-populator",
    "130": "spheniscus-demersus",
    "131": "sphyrna-mokarran",
    "132": "spinosaurus-aegyptiacus",
    "133": "stegosaurus-stenops",
    "134": "struthio-camelus",
    "135": "tapirus",
    "136": "tarsius-pumilus",
    "137": "taurotragus-oryx",
    "138": "telmatobufo-bullocki",
    "139": "thryothorus-ludovicianus",
    "140": "triceratops-horridus",
    "141": "trilobita",
    "142": "turdus-migratorius",
    "143": "tursiops-truncatus",
    "144": "tyrannosaurus-rex",
    "145": "tyrannus-tyrannus",
    "146": "ursus-arctos-horribilis",
    "147": "ursus-maritimus",
    "148": "varanus-komodoensis",
    "149": "vulpes-vulpes",
    "150": "vultur-gryphus"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "acinonyx-jubatus": 0,
    "aethia-cristatella": 1,
    "agalychnis-callidryas": 2,
    "agkistrodon-contortrix": 3,
    "ailuropoda-melanoleuca": 4,
    "ailurus-fulgens": 5,
    "alces-alces": 6,
    "anas-platyrhynchos": 7,
    "ankylosaurus-magniventris": 8,
    "apis-mellifera": 9,
    "aptenodytes-forsteri": 10,
    "aquila-chrysaetos": 11,
    "ara-macao": 12,
    "architeuthis-dux": 13,
    "ardea-herodias": 14,
    "balaenoptera-musculus": 15,
    "betta-splendens": 16,
    "bison-bison": 17,
    "bos-gaurus": 18,
    "bos-taurus": 19,
    "bradypus-variegatus": 20,
    "branta-canadensis": 21,
    "canis-lupus": 22,
    "canis-lupus-familiaris": 23,
    "carcharodon-carcharias": 24,
    "cardinalis-cardinalis": 25,
    "cathartes-aura": 26,
    "centrochelys-sulcata": 27,
    "centruroides-vittatus": 28,
    "ceratitis-capitata": 29,
    "ceratotherium-simum": 30,
    "chelonia-mydas": 31,
    "chrysemys-picta": 32,
    "circus-hudsonius": 33,
    "codium-fragile": 34,
    "coelacanthiformes": 35,
    "colaptes-auratus": 36,
    "connochaetes-gnou": 37,
    "correlophus-ciliatus": 38,
    "crocodylus-niloticus": 39,
    "crotalus-atrox": 40,
    "crotophaga-sulcirostris": 41,
    "cryptoprocta-ferox": 42,
    "cyanocitta-cristata": 43,
    "danaus-plexippus": 44,
    "dasypus-novemcinctus": 45,
    "delphinapterus-leucas": 46,
    "dendrobatidae": 47,
    "dermochelys-coriacea": 48,
    "desmodus-rotundus": 49,
    "diplodocus": 50,
    "dugong-dugon": 51,
    "eidolon-helvum": 52,
    "enhydra-lutris": 53,
    "enteroctopus-dofleini": 54,
    "equus-caballus": 55,
    "equus-quagga": 56,
    "eudocimus-albus": 57,
    "eunectes-murinus": 58,
    "falco-peregrinus": 59,
    "felis-catus": 60,
    "formicidae": 61,
    "gallus-gallus-domesticus": 62,
    "gavialis-gangeticus": 63,
    "geococcyx-californianus": 64,
    "giraffa-camelopardalis": 65,
    "gorilla-gorilla": 66,
    "haliaeetus-leucocephalus": 67,
    "hapalochlaena-maculosa": 68,
    "heloderma-suspectum": 69,
    "heterocera": 70,
    "hippopotamus-amphibius": 71,
    "homo-sapiens": 72,
    "hydrurga-leptonyx": 73,
    "icterus-galbula": 74,
    "icterus-gularis": 75,
    "icterus-spurius": 76,
    "iguana-iguana": 77,
    "iguanodon-bernissartensis": 78,
    "inia-geoffrensis": 79,
    "lampropeltis-triangulum": 80,
    "lemur-catta": 81,
    "lepus-americanus": 82,
    "loxodonta-africana": 83,
    "macropus-giganteus": 84,
    "malayopython-reticulatus": 85,
    "mammuthus-primigeniu": 86,
    "martes-americana": 87,
    "megaptera-novaeangliae": 88,
    "melanerpes-carolinus": 89,
    "mellisuga-helenae": 90,
    "mergus-serrator": 91,
    "mimus-polyglottos": 92,
    "monodon-monoceros": 93,
    "musca-domestica": 94,
    "odobenus-rosmarus": 95,
    "okapia-johnstoni": 96,
    "ophiophagus-hannah": 97,
    "orcinus-orca": 98,
    "ornithorhynchus-anatinus": 99,
    "ovis-aries": 100,
    "ovis-canadensis": 101,
    "panthera-leo": 102,
    "panthera-onca": 103,
    "panthera-pardus": 104,
    "panthera-tigris": 105,
    "pantherophis-alleghaniensis": 106,
    "pantherophis-guttatus": 107,
    "papilio-glaucus": 108,
    "passerina-ciris": 109,
    "pavo-cristatus": 110,
    "periplaneta-americana": 111,
    "phascolarctos-cinereus": 112,
    "phoebetria-fusca": 113,
    "phoenicopterus-ruber": 114,
    "phyllobates-terribilis": 115,
    "physalia-physalis": 116,
    "physeter-macrocephalus": 117,
    "poecile-atricapillus": 118,
    "pongo-abelii": 119,
    "procyon-lotor": 120,
    "pteranodon-longiceps": 121,
    "pterois-mombasae": 122,
    "pterois-volitans": 123,
    "puma-concolor": 124,
    "rattus-rattus": 125,
    "rusa-unicolor": 126,
    "salmo-salar": 127,
    "sciurus-carolinensis": 128,
    "smilodon-populator": 129,
    "spheniscus-demersus": 130,
    "sphyrna-mokarran": 131,
    "spinosaurus-aegyptiacus": 132,
    "stegosaurus-stenops": 133,
    "struthio-camelus": 134,
    "tapirus": 135,
    "tarsius-pumilus": 136,
    "taurotragus-oryx": 137,
    "telmatobufo-bullocki": 138,
    "thryothorus-ludovicianus": 139,
    "triceratops-horridus": 140,
    "trilobita": 141,
    "turdus-migratorius": 142,
    "tursiops-truncatus": 143,
    "tyrannosaurus-rex": 144,
    "tyrannus-tyrannus": 145,
    "ursus-arctos-horribilis": 146,
    "ursus-maritimus": 147,
    "varanus-komodoensis": 148,
    "vulpes-vulpes": 149,
    "vultur-gryphus": 150
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "pooler_act": "tanh",
  "pooler_output_size": 768,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.50.3"
}
